<!-- dflook/terraform-github-actions {"workspace":"app-token-username","backend":"8ac1965a4c5ff04becc4f0569b5d878649ad9d8278f9d4cb42a9db2be8694cf8","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #274 at https://github.com/dflook/terraform-github-actions/actions/runs/3496421993","plan_hash":"4b170b9da10326398d97a9341d23fdd79caa546d4b88f7d368aa3506a0f608eb","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __app-token-username__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "16mYJ2asQB" -> (known after apply)
  ~ foreach = "FxyOKdSh6I" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #274](https://github.com/dflook/terraform-github-actions/actions/runs/3496421993)